<a href="https://colab.research.google.com/github/YashDewan/BasicDataSc/blob/main/Pandas/Excercise_pandas_sol.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**import pandas as pd and numpy as np**

In [ ]:
import pandas as pd
import numpy as np

read csv from this url https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv using pandas in df variable.


If any error is printed ignore that.

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/Kokkalo4/Kaggle-SF-Salaries/master/Salaries.csv")

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2882: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

**check the head of DataFrame**

In [ ]:
df.head()

   Id       EmployeeName  ...         Agency Status
0   1     NATHANIEL FORD  ...  San Francisco    NaN
1   2       GARY JIMENEZ  ...  San Francisco    NaN
2   3     ALBERT PARDINI  ...  San Francisco    NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco    NaN
4   5    PATRICK GARDNER  ...  San Francisco    NaN

[5 rows x 13 columns]

**use the info method to find out how many entries there are.**

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

BasePay and OvertimePay both the fields are of **object** type and contains **missing data**, convert them to numeric using

 `pd.to_numeric(df[column_name], errors='coerce')`

 then check datatype using info function

In [ ]:
df["BasePay"] = pd.to_numeric(df["BasePay"], errors='coerce')
df["OvertimePay"] = pd.to_numeric(df["OvertimePay"], errors='coerce')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(6)
memory usage: 14.7+ MB

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(5), int64(2), object(6)
memory usage: 14.7+ MB

**What is the average BasePay?**

In [ ]:
df["BasePay"].mean()

66325.44884050643

**What is the highest amount of OvertimePay in the dataset?**

In [ ]:
df["OvertimePay"].max()

245131.88

**What is the Job Title of JOSEPH DRISCOLL?**

In [ ]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much does JOSEPH DRISCOLL make (including benefits)**

In [ ]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64

**What is the name of highest paid person**

In [ ]:
maxp = df["TotalPayBenefits"].max()
df[df["TotalPayBenefits"] == maxp]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

**What is the name of lowest paid person (including benefits)?**

In [ ]:
minp = df['TotalPayBenefits'].min()
locate = np.where(minp == df["TotalPayBenefits"])[0][0]
df.iloc[locate]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                    0.0
OvertimePay                                0.0
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

drop the column with **0 non-null** value, then print info

In [ ]:
# df.isnull().sum() == len(df)
# df.drop("Notes",axis=1)

df.dropna(axis=1,how="all",inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(6)
memory usage: 13.6+ MB

**What was the average (mean) BasePay of all employees per year?(2011, 2014)**

In [ ]:
# df[(df["Year"]>=2011) & (df["Year"]<=2014)]["BasePay"].mean()

df.groupby("Year")[["BasePay"]].mean().reset_index()

   Year       BasePay
0  2011  63595.956517
1  2012  65436.406857
2  2013  69630.030216
3  2014  66564.421924

**How many unique job titles are there**

In [ ]:
# len(df["JobTitle"].unique())
df["JobTitle"].nunique()

2159

**What are the top 5 most common jobs?**

In [ ]:
df["JobTitle"].value_counts().head()

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

**JobTitles with only one occurence in 2013?**

In [ ]:
(df[df["Year"] == 2013]["JobTitle"].value_counts() == 1).sum()

202

**How many people has word chief in there jobtitle?**

In [ ]:
# d = (df["JobTitle"].str.contains("chief|Chief" , regex=True)).value_counts()
# print(d)

c=0
for i in df["JobTitle"]:
  if "chief" in i.lower().split(" "):
    c+=1
print(c)

477

**Find correlation of TotalPay with other fields**

In [ ]:
# print(df["TotalPay"].corr(df["Id"]))
# print(df["TotalPay"].corr(df["BasePay"]))
df.corr()

                        Id   BasePay  ...  TotalPayBenefits      Year
Id                1.000000 -0.204878  ...         -0.092190  0.968171
BasePay          -0.204878  1.000000  ...          0.946595  0.033751
OvertimePay      -0.081505  0.266740  ...          0.467981  0.027887
TotalPay         -0.211478  0.954494  ...          0.977313  0.032090
TotalPayBenefits -0.092190  0.946595  ...          1.000000  0.151947
Year              0.968171  0.033751  ...          0.151947  1.000000

[6 rows x 6 columns]

**use np.where and replace 'Not Provided' on Benefit column to `np.nan`, then fill all this nan value with 0**

In [ ]:
# np.where(df["Benefits"] == "Not Provided").replace(np.nan)
df["Benefits"].replace("Not Provided" , np.nan,inplace=True)
df["Benefits"].fillna(0,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          148654 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(6)
memory usage: 13.6+ MB

**Now convert Benefit column to numeric type**

In [ ]:
pd.to_numeric(df["Benefits"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148654 non-null  object
 6   Benefits          148654 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Agency            148654 non-null  object
 11  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(6)
memory usage: 13.6+ MB